---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightGroup.GetLights
source: html/52e4acca-0194-8337-488f-95c7a9b29229.htm
---
# Autodesk.Revit.DB.Lighting.LightGroup.GetLights Method

Get the set of contained light instances
 The set of light instances

## Syntax (C#)
```csharp
public ICollection<ElementId> GetLights()
```